[
  {
    "period": "gen 2022 - giu 2022",
    "role": "Graphic Designer",
    "company": "Andrea Leonardi s.r.l.",
    "link": "",
    "description": "Esperienza di 6 mesi in full-remote durante la quale mi sono occupato della realizzazione di grafiche con Canva per video, presentazioni e meeting aziendali, collaborando quotidianamente con il team di copywriting per garantire coerenza visiva e comunicativa."
  },
  {
    "period": "2024 - 2025",
    "role": "Esperienza con Epicode",
    "company": "EPICODE",
    "link": "https://epicode.com/it/",
    "description": "Un'esperienza formativa completa di 6 mesi, vissuta passo dopo passo con lo studio e l'apprendimento continuo. In questo percorso ho acquisito competenze fondamentali nello sviluppo di componenti sia front-end che back-end, il tutto completamente on-demand. Il lavoro di squadra, affrontato attraverso progetti concreti, mi ha permesso di sviluppare soft skill come la comunicazione, la collaborazione e la gestione del tempo, fondamentali per lavorare in team in modo efficace."
  },
  {
    "period": "mag 2025 - ott 2025",
    "role": "Content Editor",
    "company": "PUBLICIS SAPIENT",
    "link": "https://www.publicissapient.com/",
    "description": "Durante la mia esperienza in Publicis Sapient, ho collaborato da remoto alla gestione e all’ottimizzazione dei siti web globali di <a href='https://www.maserati.com/it/it' target='_blank' rel='noopener noreferrer'><strong>Maserati</strong></a>, utilizzando Adobe CMS (AEM) per garantire coerenza e qualità dei contenuti su scala internazionale. Inoltre, ho partecipato attivamente al rilascio della collezione estiva di <a href='https://www.maserati.com/it/it/modelli/mcpura' target='_blank' rel='noopener noreferrer'><strong>McPura</strong></a> e <a href='https://www.maserati.com/it/it/modelli/mcpura-cielo' target='_blank' rel='noopener noreferrer'><strong>McPura Cielo</strong></a>, supportando le attività di pubblicazione e aggiornamento dei contenuti digitali."
  }
]
